Public Attributes | List of all members
API_VisualOverriddenImage Struct Reference
Graphic Overrides
Visual overridden image descriptor. More...
#include <APIdefs_Environment.h>
 Public Attributes
API_ImageViewID  | view
The view type identifier.
API_OverrideStyle  | overrideStyle
The visual override style of the preview image.
GSHandle  | vectorImageHandle
Handle for the output vector image.
NewDisplay::NativeImage *  | nativeImagePtr
Pointer to the output native image.
Detailed Description
Visual overridden image descriptor.
Remarks
Use this structure with ACAPI_GraphicalOverride_GetVisualOverriddenImage function.
Member Data Documentation
◆ nativeImagePtr
 API_VisualOverriddenImage::nativeImagePtr
Pointer to the output native image.
◆ overrideStyle
 API_VisualOverriddenImage::overrideStyle
The visual override style of the preview image.
◆ vectorImageHandle
 API_VisualOverriddenImage::vectorImageHandle
Handle for the output vector image.
◆ view
 API_VisualOverriddenImage::view
The view type identifier.